src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВерсииФорматаОбменаЛокальногоМодуляМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВерсииФорматаОбменаЛокальногоМодуляМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>V1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>V2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает прочитанный пароль администратора из безопасного хранилища по данным записи регистра.
//
// Параметры:
//  ХешСумма - Строка - хеш сумма настроек подключения, определяющие пароль.
// 
// Возвращаемое значение:
//  Произвольный, Структура, Неопределено - Пароль администратора из безопасного хранилища.
//
Функция ПарольАдминистратораИзБезопасногоХранилища(ХешСумма) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пароль = ПрочитатьПарольАдминистратораИзБезопасногоХранилища(ХешСумма);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Пароль;
	
КонецФункции

// Процедура сохраняет пароль администратора в безопасное хранилище под данными регистра.
//
// Параметры:
//  ХешСумма - Строка - хеш сумма настроек подключения, определяющие пароль.
//  Пароль - Строка - установленный пароль.
//
Процедура СохранитьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписатьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Конструктор записи владельца пароля и расчета хеша.
//
// Возвращаемое значение:
//  Структура - Конструктор записи владельца пароля:
// * РабочееМесто - Произвольный, Неопределено - рабочее место.
// * АдресПодключенияЛМ - Строка - строка подключения.
//
Функция КонструкторЗаписиВладельцаПароля() Экспорт
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("РабочееМесто"      , Справочники.РабочиеМеста.ПустаяСсылка());
	СтруктураВозврата.Вставить("АдресПодключенияЛМ", "");
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Возвращает ранжированный список локальных модулей "Честный знак" для офлайн проверки кодов маркировки
// от наиболее приоритетного до наименее приоритетного.
// Параметры:
//  Организация - СправочникСсылка.ОрганизацииМДЛП - организация для отправки запроса в ЛМ.
//  РабочееМесто - СправочникСсылка.РабочиеМеста - рабочее место для получения запроса.
//
// Возвращаемое значение:
//  Структура:
//  * СерверныеМодули  - Массив из КонструкторПодключенияЛокальногоМодуляЧестныйЗнак.
//  * КлиентскиеМодули - Массив из КонструкторПодключенияЛокальногоМодуляЧестныйЗнак.
//
Функция СортированнаяТаблицаЛокальныхМодулейЧестныйЗнак(Организация, РабочееМесто = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СерверныеМодули",  Неопределено);
	СтруктураВозврата.Вставить("КлиентскиеМодули", Неопределено);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НастройкиПодключенияЛокальныхМодулей.Организация               КАК Организация,
	|	НастройкиПодключенияЛокальныхМодулей.РабочееМесто              КАК РабочееМесто,
	|	НастройкиПодключенияЛокальныхМодулей.ФорматОбмена              КАК ФорматОбмена,
	|	НастройкиПодключенияЛокальныхМодулей.Приоритет                 КАК Приоритет,
	|	НастройкиПодключенияЛокальныхМодулей.ОбменНаСервере            КАК ОбменНаСервере,
	|	НастройкиПодключенияЛокальныхМодулей.АдресПодключенияЛМ        КАК АдресПодключения,
	|	НастройкиПодключенияЛокальныхМодулей.СерверПодключенияЛМ       КАК Адрес,
	|	НастройкиПодключенияЛокальныхМодулей.СерверПодключенияЛМ       КАК Сервер,
	|	НастройкиПодключенияЛокальныхМодулей.ПортПодключенияЛМ         КАК Порт,
	|	НастройкиПодключенияЛокальныхМодулей.ЗащищенноеСоединение      КАК ЗащищенноеСоединение,
	|	НастройкиПодключенияЛокальныхМодулей.Таймаут                   КАК Таймаут,
	|	НастройкиПодключенияЛокальныхМодулей.Логин                     КАК Логин,
	|	НастройкиПодключенияЛокальныхМодулей.ХешСумма                  КАК ХешСумма
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП КАК НастройкиПодключенияЛокальныхМодулей
	|ГДЕ
	|	НастройкиПодключенияЛокальныхМодулей.Организация = &Организация
	|	И ВЫБОР
	|		КОГДА &РабочееМесто = НЕОПРЕДЕЛЕНО
	|			ТОГДА НастройкиПодключенияЛокальныхМодулей.ОбменНаСервере
	|		ИНАЧЕ НастройкиПодключенияЛокальныхМодулей.РабочееМесто = &РабочееМесто
	|			ИЛИ НастройкиПодключенияЛокальныхМодулей.РабочееМесто = &ПустоеЗначениеРабочееМесто
	|	КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	ОбменНаСервере УБЫВ,
	|	Приоритет
	|");
	
	Запрос.УстановитьПараметр("Организация",                Организация);
	Запрос.УстановитьПараметр("РабочееМесто",               РабочееМесто);
	Запрос.УстановитьПараметр("ПустоеЗначениеРабочееМесто", Справочники.РабочиеМеста.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = КонструкторПодключенияЛокальногоМодуляЧестныйЗнак();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		ПарольАдминистратора = ПарольАдминистратораИзБезопасногоХранилища(ВыборкаДетальныеЗаписи.ХешСумма);
		НоваяСтрока.Пароль = ПарольАдминистратора;
		
		Если ВыборкаДетальныеЗаписи.ОбменНаСервере Тогда
			Если СтруктураВозврата.СерверныеМодули = Неопределено Тогда
				СтруктураВозврата.СерверныеМодули = Новый Массив;
			КонецЕсли;
			СтруктураВозврата.СерверныеМодули.Добавить(НоваяСтрока);
		Иначе
			Если СтруктураВозврата.КлиентскиеМодули = Неопределено Тогда
				СтруктураВозврата.КлиентскиеМодули = Новый Массив;
			КонецЕсли;
			СтруктураВозврата.КлиентскиеМодули.Добавить(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция НомерПриоритетаНастройкиПодключения(Организация, РабочееМесто) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияЛокальныхМодулей.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП КАК НастройкиПодключенияЛокальныхМодулей
	|ГДЕ
	|	НастройкиПодключенияЛокальныхМодулей.Организация = &Организация
	|	И НастройкиПодключенияЛокальныхМодулей.РабочееМесто = &РабочееМесто
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ
	|");
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Приоритет + 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Возвращает наиболее приоритетную настройку подключения по ТС ПИоТу.
// Параметры:
//  Организация  - СправочникСсылка.ОрганизацииМДЛП - организация для отправки запроса в ЛМ.
//  РабочееМесто - СправочникСсылка.РабочиеМеста - рабочее место для получения запроса.
// 
// Возвращаемое значение:
//  Структура:
//  * НастроеноПодключение - Булево - Истина, если настроено подключение к ЛМ ЧЗ
//  * Настройки - см. КонструкторПодключенияЛокальногоМодуляЧестныйЗнак
//
Функция НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто = Неопределено) Экспорт
	
	СтруктураПодключения = КонструкторПодключенияЛокальногоМодуляЧестныйЗнак();
	СтруктураВозврата    = Новый Структура("НастроеноПодключение, Настройки", Ложь, СтруктураПодключения);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПодключенияЛокальныхМодулей.Организация           КАК Организация,
	|	НастройкиПодключенияЛокальныхМодулей.РабочееМесто          КАК РабочееМесто,
	|	НастройкиПодключенияЛокальныхМодулей.ФорматОбмена          КАК ФорматОбмена,
	|	НастройкиПодключенияЛокальныхМодулей.Приоритет             КАК Приоритет,
	|	НастройкиПодключенияЛокальныхМодулей.ОбменНаСервере        КАК ОбменНаСервере,
	|	НастройкиПодключенияЛокальныхМодулей.АдресПодключенияЛМ    КАК АдресПодключения,
	|	НастройкиПодключенияЛокальныхМодулей.СерверПодключенияЛМ   КАК Адрес,
	|	НастройкиПодключенияЛокальныхМодулей.СерверПодключенияЛМ   КАК Сервер,
	|	НастройкиПодключенияЛокальныхМодулей.ПортПодключенияЛМ     КАК Порт,
	|	НастройкиПодключенияЛокальныхМодулей.ЗащищенноеСоединение  КАК ЗащищенноеСоединение,
	|	НастройкиПодключенияЛокальныхМодулей.Таймаут               КАК Таймаут,
	|	НастройкиПодключенияЛокальныхМодулей.Логин                 КАК Логин,
	|	НастройкиПодключенияЛокальныхМодулей.ХешСумма              КАК ХешСумма
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП КАК НастройкиПодключенияЛокальныхМодулей
	|ГДЕ
	|	НастройкиПодключенияЛокальныхМодулей.Организация = &Организация
	|	И ВЫБОР
	|		КОГДА &РабочееМесто = НЕОПРЕДЕЛЕНО
	|			ТОГДА НастройкиПодключенияЛокальныхМодулей.ОбменНаСервере
	|		ИНАЧЕ НастройкиПодключенияЛокальныхМодулей.РабочееМесто = &РабочееМесто
	|			ИЛИ НастройкиПодключенияЛокальныхМодулей.РабочееМесто = &ПустоеЗначениеРабочееМесто
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|");
	
	Запрос.УстановитьПараметр("Организация",                Организация);
	Запрос.УстановитьПараметр("РабочееМесто",               РабочееМесто);
	Запрос.УстановитьПараметр("ПустоеЗначениеРабочееМесто", Справочники.РабочиеМеста.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураПодключения, Выборка);
		
		ПарольАдминистратора = ПарольАдминистратораИзБезопасногоХранилища(Выборка.ХешСумма);
		
		СтруктураПодключения.Пароль = ПарольАдминистратора;
		
		СтруктураВозврата.НастроеноПодключение = Истина;
		СтруктураВозврата.Настройки            = СтруктураПодключения;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьПарольАдминистратораИзБезопасногоХранилища(ХешСумма)
	
	Возврат ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ХешСумма);
	
КонецФункции

Процедура ЗаписатьПарольАдминистратораВБезопасноеХранилище(ХешСумма, Пароль)
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ХешСумма, Пароль);
	
КонецПроцедуры


// Конструктор таблицы локальных модулей честный знак.
//
// Возвращаемое значение:
//  Структура - описание подключения локального модуля:
//   * Организация          - СправочникСсылка.ОрганизацииМДЛП - организация для отправки запроса в ЛМ.
//   * РабочееМесто         - СправочникСсылка.РабочиеМеста - рабочее место для получения запроса.
//   * ФорматОбмена         - ПеречислениеСсылка.ВерсииФорматаОбменаЛокальногоМодуляМДЛП - формат обмена с ЛМ ЧЗ.
//   * ОбменНаСервере       - Булево - Истина, если обмен производится на сервере.
//   * АдресПодключения     - Строка - адрес площадки.
//   * Адрес                - Строка - адрес сервера.
//   * Сервер               - Строка - адрес сервера.
//   * Порт                 - Число - порт.
//   * ЗащищенноеСоединение - Булево - защищенное соединение.
//   * Логин                - Строка - логин администратора ЛМ ЧЗ.
//   * Пароль               - Строка - пароль администратора ЛМ ЧЗ.
//   * Таймаут              - Число - таймаут подключения.
//
Функция КонструкторПодключенияЛокальногоМодуляЧестныйЗнак()
	
	СтруктураЛокальногоМодуля = Новый Структура;
	
	СтруктураЛокальногоМодуля.Вставить("Организация"         , Справочники.ОрганизацииМДЛП.ПустаяСсылка());
	СтруктураЛокальногоМодуля.Вставить("РабочееМесто"        , Справочники.РабочиеМеста.ПустаяСсылка());
	СтруктураЛокальногоМодуля.Вставить("ФорматОбмена"        , Перечисления.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.ПустаяСсылка());
	// ор ++
	СтруктураЛокальногоМодуля.Вставить("Приоритет"           , 0);
	// ор --
	СтруктураЛокальногоМодуля.Вставить("ОбменНаСервере"      , Ложь);
	СтруктураЛокальногоМодуля.Вставить("АдресПодключения"    , "");
	СтруктураЛокальногоМодуля.Вставить("Адрес"               , ""); // Сервер
	СтруктураЛокальногоМодуля.Вставить("Сервер"              , ""); // Адрес
	СтруктураЛокальногоМодуля.Вставить("Порт"                , 0);
	СтруктураЛокальногоМодуля.Вставить("ЗащищенноеСоединение", Ложь);
	СтруктураЛокальногоМодуля.Вставить("Логин"               , "");
	СтруктураЛокальногоМодуля.Вставить("Пароль"              , "");
	СтруктураЛокальногоМодуля.Вставить("Таймаут"             , 0);
	
	Возврат СтруктураЛокальногоМодуля;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена(Параметры) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	
	Данные = Новый ТаблицаЗначений;
	СтрокаИзмерений = "";
	
	Для Каждого ИзмерениеРегистра Из МетаданныеРегистра.Измерения Цикл
		Данные.Колонки.Добавить(ИзмерениеРегистра.Имя, ИзмерениеРегистра.Тип);
		СтрокаИзмерений = СтрокаИзмерений + ?(ЗначениеЗаполнено(СтрокаИзмерений), ", ", "") + ИзмерениеРегистра.Имя;
	КонецЦикла;
	
	ВерсияПодсистемыНаНачалоОбновления = Неопределено;
	
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("ВерсияПодсистемыНаНачалоОбновления", ВерсияПодсистемыНаНачалоОбновления);
	КонецЕсли;
	
	Если ВерсияПодсистемыНаНачалоОбновления = Неопределено Тогда
		ВерсияПодсистемыНаНачалоОбновления = ОбновлениеИнформационнойБазы.ВерсияИБ("БиблиотекаИнтеграцииМДЛП");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПодсистемыНаНачалоОбновления, "1.2.13.1") < 0 Тогда
		
		Данные_ЗаполнитьФорматОбмена = ДанныеКОбработкеДляПереходаНаНовуюВерсию_ЗаполнитьФорматОбменаПоУмолчанию();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Данные_ЗаполнитьФорматОбмена, Данные);
		
	КонецЕсли;
	
	Данные.Свернуть(СтрокаИзмерений);
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
	
КонецПроцедуры

Функция ДанныеКОбработкеДляПереходаНаНовуюВерсию_ЗаполнитьФорматОбменаПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НастройкиПодключенияЛокальныхМодулей.Организация        КАК Организация,
	|	НастройкиПодключенияЛокальныхМодулей.РабочееМесто       КАК РабочееМесто,
	|	НастройкиПодключенияЛокальныхМодулей.Приоритет          КАК Приоритет,
	|	НастройкиПодключенияЛокальныхМодулей.АдресПодключенияЛМ КАК АдресПодключенияЛМ
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП КАК НастройкиПодключенияЛокальныхМодулей
	|ГДЕ
	|	НастройкиПодключенияЛокальныхМодулей.ФорматОбмена = ЗНАЧЕНИЕ(Перечисление.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.ПустаяСсылка)
	|");
	ТаблицаИзмерений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзмерений;
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена(Параметры) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП;
	ПолноеИмяРегистра  = МетаданныеРегистра.ПолноеИмя();
	
	ВерсияПодсистемыНаНачалоОбновления = Неопределено;
	
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("ВерсияПодсистемыНаНачалоОбновления", ВерсияПодсистемыНаНачалоОбновления);
	КонецЕсли;
	
	Если ВерсияПодсистемыНаНачалоОбновления = Неопределено Тогда
		ВерсияПодсистемыНаНачалоОбновления = ОбновлениеИнформационнойБазы.ВерсияИБ("БиблиотекаИнтеграцииМДЛП");
	КонецЕсли;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			
			ЭлементБлокировки.УстановитьЗначение("Организация",  Выборка.Организация);
			ЭлементБлокировки.УстановитьЗначение("РабочееМесто", Выборка.РабочееМесто);
			ЭлементБлокировки.УстановитьЗначение("Приоритет",    Выборка.Приоритет);
			
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			НаборЗаписей = СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор["Организация"].Установить(Выборка.Организация);
			НаборЗаписей.Отбор["РабочееМесто"].Установить(Выборка.РабочееМесто);
			НаборЗаписей.Отбор["Приоритет"].Установить(Выборка.Приоритет);
			
			НаборЗаписей.Прочитать();
			
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПодсистемыНаНачалоОбновления, "1.2.13.1") < 0 Тогда
				
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.УдалитьФорматОбмена = Перечисления.ВерсииФорматаОбменаЛокальногоМодуляИСМП.V2 Тогда
						Запись.ФорматОбмена = Перечисления.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.V2;
					Иначе
						Запись.ФорматОбмена = Перечисления.ВерсииФорматаОбменаЛокальногоМодуляМДЛП.V1;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ТекстСообщения = НСтр("ru = 'Не удалось установить формат обмена по умолчанию по настройке ЛМ ЧЗ: %1 - % 2 по причине: %3'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Выборка.Организация,
				?(ЗначениеЗаполнено(Выборка.РабочееМесто), Выборка.РабочееМесто, НСтр("ru = '<без отбора по рабочему месту>'")),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				МетаданныеРегистра,,
				ТекстСообщения);
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
